export const template1 = `
สัญญาซื้อขนม  

ข้อ 1. ผู้ขายตกลงขายและผู้ซื้อตกลงซื้อขนมของผู้ขาย 
จำนวน [[จำนวนสินค้า:Number]] ชิ้น
รวมเป็นเงิน [[จำนวนเงิน:Number]] บาท 
โดยผู้ซื้อจะมารับสินคา้ที่ซื้อขายดงักล่าวในข้อนี้ด้วยตนเอง
ภายในกำหนด [[ภายใน:Number]]วัน นับตั้งแต่วันทำสัญญานี้

ข้อ 2. ในวันที่ทำสัญญานี้ผู้ซื้อได้ชำระค่ามัดจำ เป็นเงิน [[เงินมัดจำ:Number]] บาท
 ให้แก่ผู้ขายไว้เป็นเงินสดเป็นเช็คของธนาคาร [[ธนาคาร:Choice("กสิกร","กรุงไทย")]]
[[ชื่อธนาคาร:ธนาคาร]] 
เช็คเลขที่ [[เลขที่ธนาคาร]] ลงวันที่ [[วันที่:Date]]
สำหรับราคาสินค้าส่วนที่เหลือนั้นผู้ซื้อตกลงชำระใหแก่ผู้ขายภายในวันที่ [[กำหนดชำระเงิน:Date]]

ข้อ 3. หากคู่สัญญาฝ่ายหนึ่งฝ่ายใดผิดสัญญา ให้อีกฝ่ายหนึ่งมีสิทธิบอกเลิกสัญญา
และมีสิทธิเรียกร้องค่าเสียหายจากฝ่ายที่ผิดสัญญาได้ตามความเป็นจริง

 ลงชื่อ [[ชื่อผู้ขาย]] ผู้ขาย

 ลงชื่อ [[ชื่อผู้ซื้อ]] ผู้ซื้อ

`;

const template3 = `
สัญญาซื้อขาย  

ข้อ 1. ผู้ขายตกลงขายและผู้ซื้อตกลงซื้ออสินค้าของผู้ขายคือ 
จำนวน [[จำนวนสินค้า:Number]]
รวมเป็นเงิน บาท 
โดยผู้ซื้อจะมารับสินคา้ที่ซื้อขายดงักล่าวในข้อนี้ด้วยตนเอง
ภายในกำหนด……………………..วัน (…………………………………..) นับตั้งแต่วันทำสัญญานี้

ข้อ 2. ในวันที่ทำสัญญานี้ผู้ซื้อได้ชำระค่ามัดจำ เป็นเงิน ………………………บาท
 ให้แก่ผู้ขายไว้เป็นเงินสดเป็นเช็คของธนาคาร
………………………………………เช็คเลขที่………………………… ลงวันที่…………………
จำนวนเงิน…………………………….บาท (………………………………………………………)
สำหรับราคาสินค้าส่วนที่เหลืออีกเป็นเงิน……………………..บาท (……………………………..)
นั้นผู้ซื้อตกลงชำระใหแก่ผู้ขายภายใน………………………………………………………………

ข้อ 3. หากคู่สัญญาฝ่ายหนึ่งฝ่ายใดผิดสัญญา ให้อีกฝ่ายหนึ่งมีสิทธิบอกเลิกสัญญา
และมีสิทธิเรียกร้องค่าเสียหายจากฝ่ายที่ผิดสัญญาได้ตามความเป็นจริง

 ลงชื่อ………………………………………………ผู้ขาย
 (………………………………………………)
 ลงชื่อ………………………………………………ผู้ซื้อ
 (………………………………………………)

`;


export const template2=`
สัญญาซื้อขาย ชื่อ [[ชื่อ]]
`;  